# Задача 2: Найдите сумму цифр трехзначного числа. 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


num = int(input("Введите трехзначное число: "))

while num < 100 or num > 999:
    num = int(input(f'''Вы ввели не трехзначное число
Введите трехзначное число: '''))

num3 = num % 10

num2 = num // 10 % 10

num1 = num // 100 % 10

print(f'{num} -> {num1+num2+num3} ({num1} + {num2} + {num3})')
